### Series
### https://www.practiceprobs.com/problemsets/python-pandas/dataframe/party-time/

In [60]:
import pandas as pd
import numpy as np

x = pd.Series([5, 10, 15, 20, 25])

x.iloc[np.array([0, 2, 4])]

0     5
2    15
4    25
dtype: int64

In [61]:
# I turned off in line by  inlineSuggest.enabled
bar = np.array([5, 10, 15, 20, 25])
bar = pd.Series(bar)

In [62]:
bar.iloc[3] = np.nan
bar
bar.isna()
bar.notna()
bar = bar.fillna(0)
bar = bar.astype(int)
bar

0     5
1    10
2    15
3     0
4    25
dtype: int64

In [63]:
babynames = pd.Series([
    'Jathonathon', 'Zeltron', 'Ruger', 'Phreddy', 'Ruger', 'Chad', 'Chad',
    'Ruger', 'Ryan', 'Ruger', 'Chad', 'Ryan', 'Phreddy', 'Phreddy', 'Phreddy',
    'Mister', 'Zeltron', 'Ryan', 'Ruger', 'Ruger', 'Jathonathon',
    'Jathonathon', 'Ruger', 'Chad', 'Zeltron'], dtype='string')

In [71]:
count = babynames.value_counts().loc[['Chad', 'Ruger', 'Zeltron']]
count

Chad       4
Ruger      7
Zeltron    3
Name: count, dtype: Int64

In [78]:
bees = pd.Series([True, True, False, np.nan, True, False, True, np.nan])
knees = pd.Series([5,2,9,1,3,10,5,2], index = [7,0,2,6,3,5,1,4])

print(bees)
print(knees)

0     True
1     True
2    False
3      NaN
4     True
5    False
6     True
7      NaN
dtype: object
7     5
0     2
2     9
6     1
3     3
5    10
1     5
4     2
dtype: int64

In [80]:
knees.loc[pd.isna(bees).to_numpy()] *= 2
knees

7     5
0     2
2     9
6     4
3     3
5    10
1     5
4     8
dtype: int64

In [114]:
asking_prices = pd.Series([5000, 7600, 9000, 8500, 7000], index=['civic', 'civic', 'camry', 'mustang', 'mustang'])
fair_prices = pd.Series([5500, 7500, 7500], index=['civic', 'mustang', 'camry'])

new_prices = fair_prices.reindex(asking_prices.index)
mask = asking_prices <= new_prices
deal = np.where(mask.to_numpy())[0].tolist()
deal

[0, 4]

In [117]:
generator = np.random.default_rng(123)
beef_prices = pd.Series(
    data = np.round(generator.uniform(low=3, high=5, size=10), 2),
    index = generator.choice(10, size=10, replace=False)
)

Generator(PCG64)

In [130]:
index = [i for i in range(10)]
s = beef_prices.reindex(index)
compare = s - s.shift(1)
answer = compare.tolist()[1:]
idx = answer.index(max(answer))
#bad code

[1.2699999999999996,
 -1.1999999999999997,
 1.4099999999999997,
 -0.4899999999999993,
 -0.8100000000000005,
 -0.19999999999999973,
 1.4300000000000002,
 -1.6700000000000004,
 1.5100000000000002]

In [132]:
s = beef_prices.sort_index()

delta = s.diff()
day_with_biggest_jump = delta.idxmax()
day_with_biggest_jump

np.int64(9)

In [140]:
coaches = pd.Series(['Aaron', 'Donald', 'Joshua', 'Peter', 'Scott', 'Stephen'], dtype='string')
players = pd.Series(['Asher', 'Connor', 'Elizabeth', 'Emily', 'Ethan', 'Hannah', 'Isabella', 'Isaiah', 'James',
                     'Joshua', 'Julian', 'Layla', 'Leo', 'Madison', 'Mia', 'Oliver', 'Ryan', 'Scarlett', 'William',
                     'Wyatt'], dtype='string')

shuffled_players = players.sample(frac=1, random_state=0)
shuffled_players

groups = np.array_split(shuffled_players, len(coaches))
groups

team = pd.Series([g.tolist() for g in groups], index = coaches)
team

/Users/apple/devpra/dev/lib/python3.13/site-packages/numpy/_core/fromnumeric.py:54: FutureWarning: 'Series.swapaxes' is deprecated and will be removed in a future version. Please use 'Series.transpose' instead.
  return bound(*args, **kwds)

Aaron            [William, Connor, Wyatt, James]
Donald     [Julian, Scarlett, Isabella, Madison]
Joshua                [Ethan, Elizabeth, Hannah]
Peter                      [Mia, Joshua, Isaiah]
Scott                       [Ryan, Layla, Emily]
Stephen                     [Asher, Oliver, Leo]
dtype: object

### Dataframe

In [144]:
df = pd.DataFrame({
    'name': ['Bob', 'Sue', 'Mary'], 
    'age': [39, 57, 28]
})
df.info()

df.axes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

[RangeIndex(start=0, stop=3, step=1), Index(['name', 'age'], dtype='object')]

In [153]:
df.columns.get_loc('name')

0

In [149]:
df.iloc[0]
df.iloc[[1]]

  name  age
1  Sue   57

In [161]:
kids = pd.DataFrame({
    'name': pd.Series(['alice', 'mary', 'jimmy', 'johnny', 'susan'], dtype="string"),
    'age': [9, 13, 11, 15, 8],
    'with_adult': [True, False, False, True, True]
})

kids
allowed = kids[(kids['age'] >= 12) | (kids['with_adult'])]

In [167]:
print(kids.iloc[:, 0])

0     alice
1      mary
2     jimmy
3    johnny
4     susan
Name: name, dtype: string

In [169]:
def filter(age, with_adult):
    return age >= 12 or with_adult

kids.apply(lambda x : filter(x.iloc[1], x.iloc[2]), axis = 1)

0     True
1     True
2    False
3     True
4     True
dtype: bool

In [195]:
pets = pd.DataFrame(
    data={
        'name': ['Mr. Snuggles', 'Honey Chew Chew', 'Professor', 'Chairman Meow', 'Neighbelline'],
        'type': ['cat', 'dog', 'dog', 'cat', 'horse']
    },
    index=[71, 42, 11, 98, 42]
)

visits = pd.DataFrame(
    data={
        'pet_id': [42, 31, 71, 42, 98, 42],
        'date': ['2019-03-15', '2019-03-15', '2019-04-05', '2019-04-06', '2019-04-12', '2019-04-12']
    }
)

pets

               name   type
71     Mr. Snuggles    cat
42  Honey Chew Chew    dog
11        Professor    dog
98    Chairman Meow    cat
42     Neighbelline  horse

In [198]:
new_version = pets.reset_index(drop=False).rename(columns={'index':'pet_id'})
new_version

   pet_id             name   type
0      71     Mr. Snuggles    cat
1      42  Honey Chew Chew    dog
2      11        Professor    dog
3      98    Chairman Meow    cat
4      42     Neighbelline  horse

In [196]:
visits

   pet_id        date
0      42  2019-03-15
1      31  2019-03-15
2      71  2019-04-05
3      42  2019-04-06
4      98  2019-04-12
5      42  2019-04-12

In [190]:
new_pd = pd.merge(left=pets, right=visits, how='inner', left_index=True, right_on='pet_id')
new_pd

              name   type  pet_id        date
2     Mr. Snuggles    cat      71  2019-04-05
0  Honey Chew Chew    dog      42  2019-03-15
3  Honey Chew Chew    dog      42  2019-04-06
5  Honey Chew Chew    dog      42  2019-04-12
4    Chairman Meow    cat      98  2019-04-12
0     Neighbelline  horse      42  2019-03-15
3     Neighbelline  horse      42  2019-04-06
5     Neighbelline  horse      42  2019-04-12

In [212]:
new = pets.index.rename('pet_id', inplace=True)
new = pd.merge(left=pets, right=visits, how='inner', on='pet_id')

rng = np.random.default_rng(123)
new['age'] = rng.normal(loc = 5, scale = 2, size=len(new))
new

   pet_id             name   type        date       age
0      71     Mr. Snuggles    cat  2019-04-05  3.021757
1      42  Honey Chew Chew    dog  2019-03-15  4.264427
2      42  Honey Chew Chew    dog  2019-04-06  7.575851
3      42  Honey Chew Chew    dog  2019-04-12  5.387949
4      98    Chairman Meow    cat  2019-04-12  6.840462
5      42     Neighbelline  horse  2019-03-15  6.154208
6      42     Neighbelline  horse  2019-04-06  3.727073
7      42     Neighbelline  horse  2019-04-12  6.083904

In [220]:
new['date'] = pd.to_datetime(new['date'])

In [222]:
new.agg({'age': 'sum', 'date': ['min', 'max']})

          age       date
sum  43.05563        NaT
min       NaN 2019-03-15
max       NaN 2019-04-12

In [226]:
df = pd.DataFrame({
    'A': ['foo', 'bar', 'foo', 'bar', 'bar', 'foo', 'foo'],
    'B': [False, True, False, True, True, True, True],
    'C': [2.1, 1.9, 3.6, 4.0, 1.9, 7.8, 2.8],
    'D': [50, np.nan, 30, 90, 10, np.nan, 10]
}).convert_dtypes() 

bins = pd.cut(df['C'], bins=[1, 2, 3, 4, 8], right=False)
bins

0    [2, 3)
1    [1, 2)
2    [3, 4)
3    [4, 8)
4    [1, 2)
5    [4, 8)
6    [2, 3)
Name: C, dtype: category
Categories (4, interval[int64, left]): [[1, 2) < [2, 3) < [3, 4) < [4, 8)]

In [229]:
df.groupby(bins).agg({'A': 'first', 'C': 'mean', 'B': 'sum'})

/var/folders/x6/53vmlr_x6js7cggd3_v07n240000gn/T/ipykernel_16668/196456084.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby(bins).agg({'A': 'first', 'C': 'mean', 'B': 'sum'})

          A     C  B
C
[1, 2)  bar   1.9  2
[2, 3)  foo  2.45  1
[3, 4)  foo   3.6  0
[4, 8)  bar   5.9  2

In [231]:
# Same result but SORTED by group A - makes it way clearer!
print("\n" + "="*50)
print("GROUPED VIEW - sorted by A (much clearer!):")
result_sorted = result.sort_values('original_A')
print(result_sorted)

print("\nNotice:")
print("- All 'bar' rows together (C values sorted: 1.9, 4.0)")
print("- All 'foo' rows together (C values sorted: 2.1, 2.8, 7.8)")
print("- Original row positions shown in the index")

==================================================
GROUPED VIEW - sorted by A (much clearer!):
  original_A  original_C  sorted_C_within_group
1        bar         1.9                    1.9
3        bar         4.0                    4.0
4        bar         1.9                    1.9
0        foo         2.1                    2.1
2        foo         3.6                    3.6
5        foo         7.8                    7.8
6        foo         2.8                    2.8

Notice:
- All 'bar' rows together (C values sorted: 1.9, 4.0)
- All 'foo' rows together (C values sorted: 2.1, 2.8, 7.8)
- Original row positions shown in the index

In [232]:

# WAIT - you're right! The values aren't actually sorted!
# The issue: when we sort_values() in a lambda, it returns a Series 
# with ORIGINAL INDICES reordered, then transform() aligns back by INDEX

print("\n" + "="*50)
print("What's ACTUALLY happening inside transform():")
print("\nBar group - original indices [1, 3, 4], values [1.9, 4.0, 1.9]")

bar_group = df.loc[df['A'] == 'bar', 'C']
print(f"bar_group:\n{bar_group}")

sorted_bar = bar_group.sort_values()
print(f"\nAfter sort_values() - VALUES sorted but INDEX stays original:")
print(sorted_bar)

print(f"\nNow transform() aligns by INDEX back to [1, 3, 4]:")
print(f"  Index 1 gets value at index 1: {sorted_bar[1]}")
print(f"  Index 3 gets value at index 3: {sorted_bar[3]}")  
print(f"  Index 4 gets value at index 4: {sorted_bar[4]}")

print("\n^ That's why it's NOT actually sorted in the result!")
print("\nTo truly sort and align: need to reset index, sort, then realign")

==================================================
What's ACTUALLY happening inside transform():

Bar group - original indices [1, 3, 4], values [1.9, 4.0, 1.9]
bar_group:
1    1.9
3    4.0
4    1.9
Name: C, dtype: Float64

After sort_values() - VALUES sorted but INDEX stays original:
1    1.9
4    1.9
3    4.0
Name: C, dtype: Float64

Now transform() aligns by INDEX back to [1, 3, 4]:
  Index 1 gets value at index 1: 1.9
  Index 3 gets value at index 3: 4.0
  Index 4 gets value at index 4: 1.9

^ That's why it's NOT actually sorted in the result!

To truly sort and align: need to reset index, sort, then realign

In [234]:
couples = pd.DataFrame({
    'man': [
        ['fishing', 'biking', 'reading'],
        ['hunting', 'mudding', 'fishing'],
        ['reading', 'movies', 'running'],
        ['running', 'reading', 'biking', 'mudding'],
        ['movies', 'reading', 'yodeling']
    ],
    'woman': [
        ['biking', 'reading', 'movies'],
        ['fishing', 'drinking'],
        ['knitting', 'reading'],
        ['running', 'biking', 'fishing', 'movies'],
        ['movies']
    ]
})


couples

                                   man                               woman
0           [fishing, biking, reading]           [biking, reading, movies]
1          [hunting, mudding, fishing]                 [fishing, drinking]
2           [reading, movies, running]                 [knitting, reading]
3  [running, reading, biking, mudding]  [running, biking, fishing, movies]
4          [movies, reading, yodeling]                            [movies]

In [252]:
#For each couple, determine what hobbies each man has that his wife 
#doesn't and what hobbies each woman has that her husband doesn't.
result = couples.apply(lambda x: {'manonly': set(x['man'])-set(x['woman']) ,'womanonly': set(x['man'])-set(x['woman'])}, axis=1)
new_df = pd.DataFrame(result.tolist(), index=couples.index)
new_df

               manonly            womanonly
0            {fishing}            {fishing}
1   {hunting, mudding}   {hunting, mudding}
2    {movies, running}    {movies, running}
3   {reading, mudding}   {reading, mudding}
4  {reading, yodeling}  {reading, yodeling}

In [254]:
generator = np.random.default_rng(123)
df = pd.DataFrame({
    'john': generator.choice([True, False], size=10, replace=True),
    'judy': generator.choice([True, False], size=10, replace=True)
})

df

    john   judy
0   True   True
1  False  False
2  False   True
3   True  False
4  False   True
5   True   True
6   True  False
7   True  False
8   True  False
9   True  False

In [ ]:
machine_products = pd.DataFrame({
    'machine': ['abc', 'abc', 'def', 'def', 'def', 'ghi'],
    'product': ['skittles', 'soap', 'soap', 'm&ms', 'skittles', 'm&ms'],
    'stock': [10, 0, 15, 2, 0, 3]
})

In [ ]:
couples = pd.DataFrame({
    'person1': ['Cody', 'Dustin', 'Peter', 'Adam', 'Ryan', 'Brian', 'Jordan', 'Gregory'],
    'person2': ['Sarah', 'Amber', 'Brianna', 'Caitlin', 'Rachel', 'Kristen', 'Alyssa', 'Morgan']
}).convert_dtypes()

ages = pd.DataFrame({
    'person': ['Adam', 'Alyssa', 'Amber', 'Brian', 'Brianna', 'Caitlin', 'Cody', 'Dustin', 'Gregory', 'Jordan',
               'Kristen', 'Rachel', 'Morgan', 'Peter', 'Ryan', 'Sarah'],
    'age': [62, 40, 41, 50, 65, 29, 27, 39, 42, 39, 33, 61, 43, 55, 28, 36]
}).convert_dtypes()

In [ ]:
potholes = pd.DataFrame({
    'length':[5.1, np.nan, 6.2, 4.3, 6.0, 5.1, 6.5, 4.3, np.nan, np.nan],
    'width':[2.8, 5.8, 6.5, 6.1, 5.8, np.nan, 6.3, 6.1, 5.4, 5.0],
    'depth':[2.6, np.nan, 4.2, 0.8, 2.6, np.nan, 3.9, 4.8, 4.0, np.nan],
    'location':pd.Series(['center', 'north edge', np.nan, 'center', 'north edge', 'center', 'west edge',
                          'west edge', np.nan, np.nan], dtype='string')
})

In [ ]:
comments = pd.DataFrame([
    [32, pd.NA, 'Legos are awesome'],
    [12, pd.NA, 'Legos are okay..'],
      [11, 12, 'Just okay??'],
      [4, 12, 'Okay, troll..'],
        [31, 4, "I'm serious"],
      [75, 12, 'yeah, nah'],
        [41, 75, 'u from down undah?'],
          [5, 41, 'nah, yeah'],
    [82, pd.NA, 'I love legos'],
      [81, 82, 'U 4 rl?'],
        [71, 81, 'no'],
      [95, 82, 'Me too!'],
      [96, 82, 'same']
], columns=['id', 'parent_id', 'comment'])


comments.set_index('id', inplace=True)

In [ ]:
predictions = pd.DataFrame.from_dict({
    'preds': {
        12: "{'dog': 0.55, 'cat': 0.25, 'squirrel': 0.2}",
        41: "{'telephone pole': 0.8, 'tower': 0.1, 'stick': 0.1}",
        43: "{'man': 0.65, 'woman': 0.33, 'monkey': 0.02}",
        46: "{'waiter': 0.45, 'waitress': 0.30, 'newspaper': 0.15, 'cat': 0.10}",
        49: "{'nurse': 0.50, 'doctor': 0.50}",
        72: "{'baseball': 0.8, 'basketball': 0.15, 'football': 0.05}",
        91: "{'woman': 0.62, 'man': 0.28, 'elephant': 0.10}"
    }
})

### Advanced